# 2) Напишіть 5 тестів з затримкою в 2 секунди кожен, один з
# тестів повинен мати унікальне імя.
#  Запустіть їх за домогою pytest-xdist ліби в 5 потоків.
#  Запустіть цей ваш унікальний тест з маркером -k
#  додайте скірншоти виконання(не забудьте додавати -v,
#  що б я бачив що ви проганяли) і біля скріншотів пропишіть
#  команди
#  які ви використовували.

import time


def test_wait_1():
    print("чекай 2 секунди")
    time.sleep(2)


def test_wait_2():
    print("чекай 2 секунди")
    time.sleep(2)


def test_wait_3():
    print("чекай 2 секунди")
    time.sleep(2)


def test_wait_4_unique():
    print("чекай 2 секунди і зроби мені каву")
    time.sleep(2)


def test_wait_5():
    print("чекай 2 секунди")
    time.sleep(2)
