# Створіть два файли в 1-му напишіть такі функції:
#
# 1) сортування списка по зростанню числа, від меншого до більшого. Функція приймає список з чисел і повертає
# відсортований список.

# list_1 = [34, 456, 11, 12, -100, 77, 100, 35, 100.0, 100]

def sort_list_increase(x: list[int]) -> list[int]:
    return sorted(x, reverse=False)

# print(foo_1(list_1))


# 2) сортування списка на спад, від  більшого до меншого. Функція приймає список з чисел
# і повертає відсортований список.

# list_2 = [34, 456, 11, 12, -100, 77, 100, 35, 100.0, 100]

def sort_list_decrease(x: list[int]) -> list[int]:
    return sorted(x, reverse=True)

# print(foo_2(list_2))

# 3) сортування за кількістю букв у слові. Функція приймає список з слів і повертає відсортований список.

# list_3 = ['груша', 'грушаa', 'банан',  'яблуко', 'диня', "слива", "апельсин", "фу"]

def sort_list_words_increase(x: list[str]) -> list[str]:
    return sorted(x, key=len)

# print(foo_3(list_3))
