#  2-ий файл з трьома тестами який буде тестити ці три функції. В кожному тесті 1 тест.
#
# В тестових функціях ми ставимо типізацію. В першому файлі в всіх функціях проставляємо що приймає і що повертає.
# Встановіть собі пайтест і прораньте. До домашки отрім кода додайте скріншот прогона тестів.
#
# В понеділок домашки не буде. Але не відкладайте домашку.

import pytest
from lesson_7_first_file import foo_1, foo_2, foo_3

# list_1 = [34, 456, 11, 12, -100, 77, 100, 35, 100.0, 100]
# list_2 = ['груша', 'грушаa', 'банан', 'яблуко', 'диня', "слива", "апельсин", "фу"]

def test_foo_1():
    assert foo_1([34, 456, 11, 12, -100, 77, 100, 35, 100.0, 100]) == [-100, 11, 12, 34, 35, 77, 100, 100.0, 100, 456]
    print("OK")

def test_foo_2():
    assert foo_2([34, 456, 11, 12, -100, 77, 100, 35, 100.0, 100]) == [456, 100, 100.0, 100, 77, 35, 34, 12, 11, -100]

def test_foo_3():
    assert foo_3(['груша', 'грушаa', 'банан', 'яблуко', 'диня', "слива", "апельсин", "фу"]) == ['фу', 'диня', 'груша', 'банан', 'слива', 'грушаa', 'яблуко', 'апельсин']
