# Задача 1
# Уявимо що до нас прийшов наш друг або подруга і попросили написати додаток для покупок в магазині
# що б можна було скласти список продуктів та коли купуєш викреслювати(для викреслення питайте номер елемента,
# що б видалити по індексу треба його передати в pop list_a.pop(0) - видалить нульовий індекс, памятайте що користувач
# не знає що в нас індекси починаються з нуля)
# Також нам відомо що цей список має завжди пять елементів.
# Після кожного видалення елементу виводьте наш оновлений список.
# Після 5 видалень перевірте чи список пустий якщо не пустий напишіть що ось ще є продукти, якщо пусти то напишіть
# про це.
# Також після цього кроку запропонуйте користувачу написати ще продуктів та додати його в кошик.
# і виведіть їх на екран. Але цього разу вже без видалень.
# кроки:
# Спочатку пропонуємо користувачу ввести продукти.
# Робимо 5 запитів на видалення
# Перевіряємо корзину
# Пропонуємо додати продукти
# Виводмо список і прощаємось

# банан, слива кокос, груша пармезан гуталакс

user_str = input("Введіть список продуктів через пробіл (спикок не може бути меньшим 5ти) \n").replace(",", "").title()
prod_list = user_str.split()
# print(type(prod_list))

if len(prod_list) < 5:
    print("ви ввели меньше 5ти продуктів")
    exit()

print("зараз є ось такі продукти в вашому списку:", prod_list)

q = int(input("введіть номер продуктів який купили для того що б видалити \n"))
if q >= 1 and q <= len(prod_list):
    print("Видаленно:", prod_list.pop(q-1))
else:
    print("нема такого, спобуйте ще раз")

print("зараз є ось такі продукти в вашому списку:", prod_list)

q = int(input("введіть номер продуктів який купили для того що б видалити \n"))
if q >= 1 and q <= len(prod_list):
    print("Видаленно:", prod_list.pop(q-1))
else:
    print("нема такого, спобуйте ще раз")

print("зараз є ось такі продукти в вашому списку:", prod_list)

q = int(input("введіть номер продуктів який купили для того що б видалити \n"))
if q >= 1 and q <= len(prod_list):
    print("Видаленно:", prod_list.pop(q-1))
else:
    print("нема такого, спобуйте ще раз")

print("зараз є ось такі продукти в вашому списку:", prod_list)

q = int(input("введіть номер продуктів який купили для того що б видалити \n"))
if q >= 1 and q <= len(prod_list):
    print("Видаленно:", prod_list.pop(q-1))
else:
    print("нема такого, спобуйте ще раз")

print("зараз є ось такі продукти в вашому списку:", prod_list)

q = int(input("введіть номер продуктів який купили для того що б видалити \n"))
if q >= 1 and q <= len(prod_list):
    print("Видаленно:", prod_list.pop(q-1))
else:
    print("нема такого, спобуйте ще раз")

if len(prod_list) == 0:
    print("вже порожньо")
else:
    print("ще є", prod_list)

user_ask = input("Бажаєте додати ще продукти до кошика? (так/ні) \n").title()
if user_ask == "Так":
    user_ask_list = input("Введіть список продуктів через пробіл (спикок не може бути меньшим 5ти) \n").split()
    prod_list.extend(user_ask_list)
    print("Додано ще:", prod_list, "Бувайте")
else:
    print("Бувайте")

