# Задача 1
# Уявимо що до нас прийшов наш друг або подруга і попросили написати додаток для покупок в магазині
# що б можна було скласти список продуктів та коли купуєш викреслювати(для викреслення питайте номер елемента,
# що б видалити по індексу треба його передати в pop list_a.pop(0) - видалить нульовий індекс, памятайте що користувач
# не знає що в нас індекси починаються з нуля)
# Також нам відомо що цей список має завжди пять елементів.
# Після кожного видалення елементу виводьте наш оновлений список.
# Після 5 видалень перевірте чи список пустий якщо не пустий напишіть що ось ще є продукти, якщо пусти то напишіть
# про це.
# Також після цього кроку запропонуйте користувачу написати ще продуктів та додати його в кошик.
# і виведіть їх на екран. Але цього разу вже без видалень.
# кроки:
# Спочатку пропонуємо користувачу ввести продукти.
# Робимо 5 запитів на видалення
# Перевіряємо корзину
# Пропонуємо додати продукти
# Виводмо список і прощаємось

# банан, слива кокос, груша пармезан гуталакс

user_str = input("Введіть список продуктів через пробіл (спикок не може бути меньшим 5ти) \n").replace(",", "").title()
prod_list = user_str.split()
print(type(prod_list))

if len(prod_list) < 5:
    print("ви ввели меньше 5ти продуктів")
    exit()

print("Купили:", prod_list.pop(0), "\n В кошику:", prod_list)
print("Купили:", prod_list.pop(0), "\n В кошику:", prod_list)
print("Купили:", prod_list.pop(0), "\n В кошику:", prod_list)
print("Купили:", prod_list.pop(0), "\n В кошику:", prod_list)
print("Купили:", prod_list.pop(0), "\n В кошику:")

if len(prod_list) == 0:
    print("вже порожньо")
else:
    print("ще є", prod_list)

user_ask = input("Бажаєте додати ще продукти до кошика? (так/ні) \n").title()
if user_ask == "Так":
    user_ask_list = input("Введіть список продуктів через пробіл (спикок не може бути меньшим 5ти) \n").split()
    prod_list.extend(user_ask_list)
    print("Додано ще:", prod_list, "Бувайте")
else:
    print("Бувайте")

# Задача 2
# Напишіть програму яка запитує в користувача вартість покупок, він їх вводе через пробіл, точна кількість не вказана.
# Вам потрібно до вартості покупок додати 6,5 відсотки податків.
# Потім питаєте чи є в користувача купон на знижку якщо є то питаєте це на суму чи на відсоток і потім віднімаєте суму
# або відсоток відповідно від ціни яку отримали раніше і пишете користувачу кінцеву суму.
#
# завдання з зірочкою не впливає на бал. Округліть суму якщо копійок більше ніж 44 то це буде + 1 гривня, якщо менше.
# то тоді просто відкидаємо копійки від ціни.
# Бажаю вам успіхів в виконанні завдання. Не забутьте скористатись виправленням синтаксису в кінці задачі і перевірити
# чи вона у вас працює.

user_shoping = input("Яка вартість покупок? (вводимо через пробіл) \n").replace(",", ".").split()
user_shoping = [float(i) for i in user_shoping]
user_sum = sum(user_shoping)
print(user_sum)
user_tax = user_sum * (6.5 / 100) + user_sum

user_coupon = input("чи є в користувача купон на знижку? (так/ні) \n").lower()
if user_coupon == "так":
   sum_or_percent = input("це на суму чи на відсоток? (суму/відсоток) \n").lower()
   if sum_or_percent == "суму":
       coupon_sum = float(input("на яку суму? \n"))
       user_tax = user_tax - coupon_sum
       print("До сплати:", round(user_tax, 2))
   elif sum_or_percent == "відсоток":
       coupon_percent = float(input("на який відсоток? \n"))
       user_tax = user_tax - (user_tax * (coupon_percent / 100))

       print("До сплати:", round(user_tax, 2))
   else:
       print("не зрозуміло суму чи відсоток, спробуйте ще раз")

user_tax_rounded = round(user_tax, 0)
user_sum_with_tax = round(user_tax, 2)
rest = user_sum_with_tax - round(user_tax_rounded, 0)

if rest > 0.44:
    user_tax_rounded = user_tax_rounded + 1

print("Тоді до сплати:", user_tax_rounded)

