# Зробіть словник де буде табличка множення додавання ділення і віднімання чисел від 2 до 9(включно).
# (так як робили на уроці). Ці значення запишіть в словник з відповідними ключами "+", "-", "/", "*"
#
# Коли ви підготуєте це, запитайте в користувача яку табличку він хоче
# побачити (додавання, віднімання, множення, ділення). і виведіть йому цю табличку.

nums_for_calc = [2, 3, 4, 5, 6, 7, 8, 9]
dict_calc = {"+": [], "-": [], "/": [], "*": []}
for i in nums_for_calc:
    for j in nums_for_calc:
        # dict_calc = {"+": i + j, "-": [i - j], "/": [i / j], "*": [i * j]}
        dict_calc["+"].append(i + j)
        dict_calc["-"].append(i - j)
        dict_calc["/"].append(i / j)
        dict_calc["*"].append(i * j)
user_mess = input("\n")
print(dict_calc[user_mess])
